In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame(

    {

        "Name": [

            "Braund, Mr. Owen Harris",

            "Allen, Mr. William Henry",

            "Bonnell, Miss. Elizabeth",

        ],

        "Age": [22, 35, 58],

        "Sex": ["male", "male", "female"],

    }

)

In [3]:
df

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

# Each column in a DataFrame is a Series

In [6]:
df["Age"]

0    22
1    35
2    58
Name: Age, dtype: int64

In [7]:
df["Sex"]

0      male
1      male
2    female
Name: Sex, dtype: object

In [14]:
for person in df.iterrows():
    for i in person:
        print(i)
    print("\n")

0
Name    Braund, Mr. Owen Harris
Age                          22
Sex                        male
Name: 0, dtype: object


1
Name    Allen, Mr. William Henry
Age                           35
Sex                         male
Name: 1, dtype: object


2
Name    Bonnell, Miss. Elizabeth
Age                           58
Sex                       female
Name: 2, dtype: object

In [15]:
df["Age"]

0    22
1    35
2    58
Name: Age, dtype: int64

In [18]:
max = 0
for i in df["Age"]:
    if i > max:
        max = i
print(max)

58

In [19]:
df["Age"].max()

58


REMEMBER

    Import the package, aka import pandas as pd

    A table of data is stored as a pandas DataFrame

    Each column in a DataFrame is a Series

    You can do things by applying a method to a DataFrame or Series

In [20]:
df.describe()

             Age
count   3.000000
mean   38.333333
std    18.230012
min    22.000000
25%    28.500000
50%    35.000000
75%    46.500000
max    58.000000

In [21]:
df["Age"].describe()

count     3.000000
mean     38.333333
std      18.230012
min      22.000000
25%      28.500000
50%      35.000000
75%      46.500000
max      58.000000
Name: Age, dtype: float64